app/Tenancy/StorageTenancyBootstrapper.php

select * from `domains` where `domains`.`tenant_id` = 1001 and `domains`.`tenant_id` is not null
---
    private function configureFilesystemDisks($tenantId): void
    {
        $rootPath = storage_path("tenant{$tenantId}/app/public");
        $internalRoot = storage_path("tenant{$tenantId}/app");

        // 🔥 FIX: Tenant domain kullan (ixtif.com gibi), config('app.url') değil
        $tenantDomain = null;
        if (tenant() && tenant()->domains) {
            $domain = tenant()->domains->first();