Modules/Search/app/Models/SearchQuery.php

select query, MAX(slug) as slug, COUNT(*) as search_count from `search_queries` where `is_popular` = 1 and `is_hidden` = 0 group by `query` order by `search_count` desc limit 10
---
    public static function getMarkedPopular(int $limit = 10)
    {
        return static::query()
            ->where('is_popular', true)
            ->where('is_hidden', false)
            ->selectRaw('query, MAX(slug) as slug, COUNT(*) as search_count')
            ->groupBy('query')
            ->orderByDesc('search_count')
            ->limit($limit)
            ->get();