app/Services/DatabaseConnectionPoolService.php

    protected function createTenantDatabaseConnection($tenantKey, $connectionName)
    {
        // Tenant'ın gerçek database adını al
        $tenant = \App\Models\Tenant::find($tenantKey);
---
select * from `tenants` where `tenants`.`id` = 1001 limit 1