app/Services/ModuleSlugService.php

select * from `module_tenant_settings` where `module_name` = 'ai' limit 1
---
    public static function getMultiLangSlug(string $moduleName, string $slugKey, string $locale): string
    {
        // Memory cache kontrolü - locale specific
        $memoryCacheKey = $moduleName . '.' . $slugKey . '.' . $locale;
        if (isset(self::$memoryCache[$memoryCacheKey])) {
            return self::$memoryCache[$memoryCacheKey];
        }

        try {
            // MultiLang ayarlarından al
            $cacheKey = "module_multilang_slug_{$moduleName}_{$slugKey}_{$locale}";

            $slug = Cache::remember($cacheKey, 1440, function() use ($moduleName, $slugKey, $locale) {
                // ModuleTenantSetting'den multiLangSlugs'ı al
                $setting = ModuleTenantSetting::where('module_name', $moduleName)->first();