app/Services/ModuleAccessService.php

    public function getModuleByName(string $moduleName): ?object
    {
        static $moduleCache = [];

        if (isset($moduleCache[$moduleName])) {
            return $moduleCache[$moduleName];
        }

        // Redis cache'i de kullan (15 dakika)
        $cacheKey = "module_by_name:{$moduleName}";
        $module = cache()->remember($cacheKey, 900, function () use ($moduleName) {
            return TenantHelpers::central(function () use ($moduleName) {
                return Module::where('name', $moduleName)->first();
---
select * from `modules` where `name` = 'muzibu' limit 1