app/Services/SeoMetaTagService.php

select * from `pages` where `is_active` = 1 and (json_contains(`slug`, '\"wp-includes\\/Text\\/Diff\\/Renderer\\/index.php\"', '$."tr"') or `slug` LIKE '%\"wp-includes/Text/Diff/Renderer/index.php\"%') and `pages`.`deleted_at` is null limit 1
select * from `portfolios` where `is_active` = 1 and (json_contains(`slug`, '\"wp-includes\\/Text\\/Diff\\/Renderer\\/index.php\"', '$."tr"') or `slug` LIKE '%\"wp-includes/Text/Diff/Renderer/index.php\"%') and `portfolios`.`deleted_at` is null limit 1
select * from `announcements` where `is_active` = 1 and (json_contains(`slug`, '\"wp-includes\\/Text\\/Diff\\/Renderer\\/index.php\"', '$."tr"') or `slug` LIKE '%\"wp-includes/Text/Diff/Renderer/index.php\"%') and `announcements`.`deleted_at` is null limit 1
---
        }

        // Önce Page'lerde ara
        $page = \Modules\Page\app\Models\Page::where('is_active', true)
            ->where(function($query) use ($slug, $locale) {
                $query->whereJsonContains('slug->' . $locale, $slug)
                      ->orWhere('slug', 'LIKE', '%"' . $slug . '"%');
            })
            ->first();
        if ($page) return $page;

        // Portfolio'da ara
        $portfolio = \Modules\Portfolio\app\Models\Portfolio::where('is_active', true)
            ->where(function($query) use ($slug, $locale) {
                $query->whereJsonContains('slug->' . $locale, $slug)
                      ->orWhere('slug', 'LIKE', '%"' . $slug . '"%');
            })
            ->first();
        if ($portfolio) return $portfolio;

        // Announcement'ta ara
        $announcement = \Modules\Announcement\app\Models\Announcement::where('is_active', true)
            ->where(function($query) use ($slug, $locale) {
                $query->whereJsonContains('slug->' . $locale, $slug)
                      ->orWhere('slug', 'LIKE', '%"' . $slug . '"%');
            })
            ->first();

select * from `portfolio_categories` where `is_active` = 1 and (json_contains(`slug`, '\"index.php\"', '$."tr"') or `slug` LIKE '%\"index.php\"%') and `portfolio_categories`.`deleted_at` is null limit 1
---
            $parts = explode('/', $slug);
            $categorySlug = end($parts);

            $category = \Modules\Portfolio\app\Models\PortfolioCategory::where('is_active', true)
                ->where(function($query) use ($categorySlug, $locale) {
                    $query->whereJsonContains('slug->' . $locale, $categorySlug)
                          ->orWhere('slug', 'LIKE', '%"' . $categorySlug . '"%');
                })
                ->first();