app/Services/SettingsService.php

select * from `settings` where `key` = 'mail_driver' and `is_active` = 1 limit 1
select * from `settings_values` where `setting_id` = 241 limit 1
---
    public function get($key, $default = null)
    {
        $isTenant = function_exists('is_tenant') ? is_tenant() : false;
        $tenantId = function_exists('tenant_id') ? tenant_id() : null;

        // Cache anahtarını oluştur
        $cacheKey = $isTenant ? "tenant_{$tenantId}_settings_{$key}" : "settings_{$key}";

        try {
            // Önce setting ID'sini bul
            $setting = Setting::where('key', $key)
                ->where('is_active', true)
                ->first();

            if (!$setting) {
                return $default;
            }

            // Her durumda önce settings_values tablosuna bak
            try {
                // PERFORMANCE: Cache table existence check for 1 hour
                $tableExists = cache()->remember('settings_values_table_exists', 3600, function() {
                    return Schema::hasTable('settings_values');
                });

                if ($tableExists) {
                    // Önce settings_values tablosunu sorgula
                    $customValue = DB::table('settings_values')
                        ->where('setting_id', $setting->id)
                        ->first();

select * from `settings_values` where `setting_id` in (1, 2, 3, 4, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 47, 48, 49, 50, 51, 52, 53, 55, 56, 59, 62, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 91, 92, 93, 94, 95, 96, 97, 98, 99, 100, 101, 102, 103, 104, 105, 112, 113, 114, 115, 117, 120, 130, 145, 152, 156, 157, 160, 161, 162, 163, 164, 165, 166, 168, 170, 171, 173, 193, 194, 198, 199, 200, 201, 205, 206, 207, 211, 212, 223, 224, 225, 226, 227, 228, 229, 230, 231, 232, 233, 234, 235, 236, 237, 238, 239, 240, 241, 242, 243, 244, 245, 246, 247, 248, 249, 250, 251, 252, 253)
---
    public function getById($id, $default = null)
    {
        $isTenant = function_exists('is_tenant') ? is_tenant() : false;
        $tenantId = function_exists('tenant_id') ? tenant_id() : null;

        try {
            // Central veritabanından settings kaydını bul
            $setting = Setting::find($id);

            if (!$setting || !$setting->is_active) {
                return $default;
            }

            // Her durumda önce settings_values tablosuna bak
            try {
                // PERFORMANCE: Cache table existence check for 1 hour
                $tableExists = cache()->remember('settings_values_table_exists', 3600, function() {
                    return Schema::hasTable('settings_values');
                });

                if ($tableExists) {
                    // Önce settings_values tablosunu sorgula
                    $customValue = DB::table('settings_values')
                        ->where('setting_id', $id)
                        ->first();

                    // Özel değer varsa döndür
                    if ($customValue && $customValue->value !== null && $customValue->value !== '') {