app/Services/SettingsService.php

select * from `settings` where `is_active` = 1
---
    protected function fetchAllSettingsFromDB(): array
    {
        $result = [];

        // 1. Tüm aktif settings'i çek (central DB'den)
        $settings = Setting::where('is_active', true)->get();