app/Services/TenantLanguageProvider.php

    public static function getActiveLanguageCodes(): array
    {
        $cacheKey = self::CACHE_PREFIX . 'codes_' . self::getTenantCacheKey();

        return Cache::remember($cacheKey, self::CACHE_TTL, function () {
            return TenantLanguage::where('is_active', true)
                ->orderBy('sort_order')
                ->pluck('code')
                ->toArray();
---
select `code` from `tenant_languages` where `is_active` = 1 order by `sort_order` asc

    public static function getLanguageNativeNames(): array
    {
        $cacheKey = self::CACHE_PREFIX . 'native_names_' . self::getTenantCacheKey();

        return Cache::remember($cacheKey, self::CACHE_TTL, function () {
            return TenantLanguage::where('is_active', true)
                ->pluck('native_name', 'code')
                ->toArray();
---
select `native_name`, `code` from `tenant_languages` where `is_active` = 1