Modules/LanguageManagement/app/Http/Livewire/AdminLanguageSwitcher.php

    public function render()
    {
        // Admin admin_languages tablosundan aktif dilleri çek
        $adminLanguages = AdminLanguage::where('is_active', true)
            ->orderBy('sort_order')
            ->get();

        // Site tenant_languages tablosundan aktif dilleri çek
        $siteLanguages = DB::table('tenant_languages')
            ->where('is_active', true)
            ->orderBy('sort_order')
            ->get();
---
select * from `tenant_languages` where `is_active` = 1 order by `sort_order` asc