Modules/Cart/app/Http/Controllers/Front/OrderHistoryController.php

select * from `cart_orders` where `order_number` = 'ORD20251226BBCA29' and `user_id` = 1 and `cart_orders`.`deleted_at` is null limit 1
---
    public function showByNumber(string $orderNumber)
    {
        $user = Auth::user();

        $order = Order::where('order_number', $orderNumber)
            ->where('user_id', $user->id)
            ->with(['items', 'payments'])
            ->firstOrFail();

        // Ödeme bilgisi
        $payment = $order->payments()->latest()->first();