Modules/Muzibu/app/View/Composers/SidebarComposer.php

select `favoritable_type`, `favoritable_id` from `favorites` where `user_id` = 1
---
    protected function loadUserFavorites(): array
    {
        if (!auth()->check()) {
            return [];
        }

        $userId = auth()->id();

        // Model class → type mapping
        $typeMap = [
            'Modules\\Muzibu\\app\\Models\\Song' => 'song',
            'Modules\\Muzibu\\App\\Models\\Song' => 'song',
            'Modules\\Muzibu\\app\\Models\\Album' => 'album',
            'Modules\\Muzibu\\App\\Models\\Album' => 'album',
            'Modules\\Muzibu\\app\\Models\\Playlist' => 'playlist',
            'Modules\\Muzibu\\App\\Models\\Playlist' => 'playlist',
            'Modules\\Muzibu\\app\\Models\\Genre' => 'genre',
            'Modules\\Muzibu\\App\\Models\\Genre' => 'genre',
            'Modules\\Muzibu\\app\\Models\\Sector' => 'sector',
            'Modules\\Muzibu\\App\\Models\\Sector' => 'sector',
            'Modules\\Muzibu\\app\\Models\\Radio' => 'radio',
            'Modules\\Muzibu\\App\\Models\\Radio' => 'radio',
            'Modules\\Muzibu\\app\\Models\\Artist' => 'artist',
            'Modules\\Muzibu\\App\\Models\\Artist' => 'artist',
        ];

        // Single query to get all favorites
        $favorites = DB::table('favorites')
            ->where('user_id', $userId)
            ->get(['favoritable_type', 'favoritable_id']);