Modules/LanguageManagement/app/Helpers/language_helpers.php

    function available_admin_languages(): array
    {
        // PERFORMANCE: Use same cache key as AdminLanguageSwitcher to prevent duplicates
        $cached = \Cache::remember('admin_languages_switcher', 600, function() {
            try {
                return \Modules\LanguageManagement\App\Models\AdminLanguage::where('is_active', true)
                    ->orderBy('sort_order')
                    ->get();
---
select * from `admin_languages` where `is_active` = 1 order by `sort_order` asc