Modules/Muzibu/app/Models/CorporateSpotPlay.php

    public static function logPlay(
        int $spotId,
        int $corporateAccountId,
        ?int $userId = null,
        ?string $sourceType = null,
        ?int $sourceId = null
    ): self {
        $request = request();

        return self::create([
            'spot_id' => $spotId,
            'corporate_account_id' => $corporateAccountId,
            'user_id' => $userId,
            'ip_address' => $request->ip(),
            'user_agent' => substr($request->userAgent() ?? '', 0, 255),
            'device_type' => self::detectDeviceType($request->userAgent()),
            'browser' => self::detectBrowser($request->userAgent()),
            'platform' => self::detectPlatform($request->userAgent()),
            'source_type' => $sourceType,
            'source_id' => $sourceId,
        ]);
---
insert into `muzibu_corporate_spot_plays` (`spot_id`, `corporate_account_id`, `user_id`, `ip_address`, `user_agent`, `device_type`, `browser`, `platform`, `source_type`, `source_id`, `updated_at`, `created_at`) values (3, 1, 1, '92.44.171.31', 'Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/143.0.0.0 Safari/537.36', 'desktop', 'Chrome', 'macOS', 'player', '', '2025-12-31 23:47:32', '2025-12-31 23:47:32')