Modules/Muzibu/app/Models/MuzibuCorporateAccount.php

    public function getNextSpot(): ?CorporateSpot
    {
        // Spot sistemi kapalıysa veya durdurulmuşsa null döndür
        if (!$this->spot_enabled || $this->spot_is_paused) {
            return null;
        }

        $spot = CorporateSpot::getNextSpot($this->id, $this->spot_current_index);

        if ($spot) {
            // Bir sonraki index'e geç
            $this->increment('spot_current_index');
---
update `muzibu_corporate_accounts` set `spot_current_index` = `spot_current_index` + 1, `muzibu_corporate_accounts`.`updated_at` = '2026-01-01 00:32:37' where `id` = 1