Modules/Favorite/routes/api.php


            $favorites = \Cache::remember($cacheKey, 60, function () use ($userId) {
                // 🔥 OPTIMIZED: Select only needed columns, no full row fetch
                return \DB::table('favorites')
                    ->where('user_id', $userId)
                    ->whereNotNull('favoritable_type')
                    ->select('favoritable_type', 'favoritable_id')
                    ->get()
                    ->map(function($fav) {
                        // Model class'tan type'ı çıkar (Modules\Muzibu\App\Models\Song -> song)
                        $type = strtolower(class_basename($fav->favoritable_type));
                        return "{$type}-{$fav->favoritable_id}";
                    })
                    ->values()
                    ->toArray();
---
select `favoritable_type`, `favoritable_id` from `favorites` where `user_id` = 1 and `favoritable_type` is not null