Modules/Subscription/app/Services/SubscriptionService.php

select * from `subscriptions` where `user_id` = 1 and `status` = 'active' and `current_period_end` > '2025-12-26 21:18:20' and `subscriptions`.`deleted_at` is null limit 1
---
    public function checkUserAccess(User $user): array
    {
        // 1. Subscription kontrolü (FRESH - cache yok!)
        $sub = Subscription::where('user_id', $user->id)
            ->where('status', 'active')
            ->where('current_period_end', '>', now())
            ->first();