Modules/Subscription/app/Services/SubscriptionService.php

    public function checkUserAccess(User $user): array
    {
        $cacheKey = 'user_' . $user->id;

        // Return cached result if available
        if (isset(self::$accessCache[$cacheKey])) {
            return self::$accessCache[$cacheKey];
        }

        // 🔴 SINGLE SOURCE OF TRUTH: users.subscription_expires_at
        // Bu alan tüm subscription süresinin toplamını tutar
        $expiresAt = $user->subscription_expires_at;

        if ($expiresAt && $expiresAt->isFuture()) {
            $daysRemaining = (int) now()->diffInDays($expiresAt, false);

            // Trial kontrolü: Subscription tablosundan aktif trial var mı?
            $isTrial = Subscription::where('user_id', $user->id)
                ->where('status', 'trial')
                ->whereNotNull('trial_ends_at')
                ->where('trial_ends_at', '>', now())
                ->exists();
---
select exists(select * from `subscriptions` where `user_id` = 1 and `status` = 'trial' and `trial_ends_at` is not null and `trial_ends_at` > '2025-12-29 01:28:59' and `subscriptions`.`deleted_at` is null) as `exists`