Modules/Payment/app/Http/Controllers/PayTRCallbackController.php

select * from `tenants` where `tenants`.`id` = 1001 limit 1
---
    public function handle(Request $request)
    {
        try {
            // POST verilerini al
            $callbackData = $request->all();

            if (setting('paytr_debug', false)) {
                Log::info('📨 PayTR callback received', $callbackData);
            }

            // Tenant ID parse et (merchant_oid formatı: T{tenant_id}-ORD-20251112-ABC)
            $merchantOid = $callbackData['merchant_oid'] ?? '';
            $tenantId = $this->parseTenantId($merchantOid);

            if (!$tenantId) {
                Log::error('❌ PayTR callback: Tenant ID parse edilemedi', [
                    'merchant_oid' => $merchantOid
                ]);
                return response('FAIL: Invalid merchant_oid format', 400);
            }

            // Tenant context'e gir
            $tenant = \App\Models\Tenant::find($tenantId);