app/Helpers/AdminTitleHelper.php

select * from `module_tenant_settings` where `module_name` = 'muzibu' limit 1
---
    private static function getModuleTitleFromDB(): string
    {
        $currentModule = self::getCurrentModule();

        if (!$currentModule) {
            return 'Admin';
        }

        try {
            // 1. module_tenant_settings.title JSON kontrolü (öncelik)
            $tenantSetting = DB::table('module_tenant_settings')
                ->where('module_name', $currentModule)
                ->first();

select * from `settings_values` where `id` = 6 limit 1
---
    private static function getCompanyName(): string
    {
        try {
            // 1. settings_values tablosunda ID=6'ya bak
            $settingValue = DB::table('settings_values')
                ->where('id', 6)
                ->first();