app/Helpers/CreditHelpers.php

    function ai_get_credit_balance(?string $tenantId = null): float
    {
        try {
            // Admin paneli için - kullanıcının default tenant'ını al
            if (!$tenantId) {
                $tenantId = (string) (tenant('id') ?: null);

                // Tenant context yok (admin panel) - kullanıcının default tenant'ını bul
                if (!$tenantId && auth()->check()) {
                    $user = auth()->user();
                    $tenantId = $user->tenant_id ? (string) $user->tenant_id : null;

                    // Hala tenant yok - ilk tenant'ı al (development için)
                    if (!$tenantId) {
                        $firstTenant = Tenant::first();
                        $tenantId = $firstTenant?->id ? (string) $firstTenant->id : null;
                    }
                }

                // Son çare
                if (!$tenantId) {
                    Log::warning('ai_get_credit_balance: No tenant context found');
                    return 0.0;
                }
            }

            // Tenant'ı bul
            $tenant = is_numeric($tenantId) ? Tenant::find($tenantId) : null;
---
select * from `tenants` where `tenants`.`id` = '1001' limit 1