app/Helpers/TenantHelpers.php

select `domain` from `domains` where `tenant_id` = 1001 order by `is_primary` desc limit 1
---
    public static function getTenantDomain(?int $tenantId = null): ?string
    {
        if (!$tenantId) {
            $tenantId = self::resolveCurrentTenantId();
        }

        if (!$tenantId) {
            return null;
        }

        // Central database'den doğrudan sorgu (tenant context'ten bağımsız)
        return DB::connection('mysql')->table('domains')
            ->where('tenant_id', $tenantId)
            ->orderByDesc('is_primary')
            ->value('domain');