Modules/Payment/app/Services/PayTRCallbackService.php

    public function handleCallback(array $callbackData): array
    {
        try {
            // 1. Gerekli alanları kontrol et
            $merchantOid = $callbackData['merchant_oid'] ?? null;
            $status = $callbackData['status'] ?? null;
            $totalAmount = $callbackData['total_amount'] ?? null;
            $hash = $callbackData['hash'] ?? null;

            if (!$merchantOid || !$status || !$hash) {
                Log::error('❌ PayTR callback: Eksik parametreler', $callbackData);
                return ['success' => false, 'message' => 'Eksik parametreler'];
            }

            // 2. Payment kaydını bul
            // Önce gateway_transaction_id ile ara (PayTR'ye gönderilen merchant_oid)
            $payment = Payment::where('gateway_transaction_id', $merchantOid)->first();
---
select * from `payments` where `gateway_transaction_id` = 'T1001PAY20260105155940C8E543' and `payments`.`deleted_at` is null limit 1