Modules/Muzibu/app/Http/Controllers/Api/QueueRefillController.php

    public function initialQueue(Request $request): JsonResponse
    {
        try {
            $limit = 15;
            $userId = auth()->id();
            $songs = [];
            $context = null;

            if ($userId) {
                // 🎵 LOGIN USER: Son dinlenen şarkıyı al (optimized single query)
                $lastPlay = DB::table('muzibu_song_plays')
                    ->where('user_id', $userId)
                    ->orderBy('created_at', 'desc')
                    ->select('song_id')
                    ->first();
---
select `song_id` from `muzibu_song_plays` where `user_id` = 1 order by `created_at` desc limit 1