Modules/Muzibu/app/Http/Controllers/Api/SongStreamController.php

    public function trackProgress(\Illuminate\Http\Request $request, int $songId): JsonResponse
    {
        try {
            // 🔥 FIX: Hem web hem sanctum guard'ı kontrol et
            $user = auth('web')->user() ?? auth('sanctum')->user();

            if (!$user) {
                return response()->json(['error' => 'unauthorized'], 401);
            }

            $song = Song::findOrFail($songId);
            $userId = $user->id;

            // 🔒 Duplicate kontrolü: Aynı kullanıcı + şarkı için son 30 saniyede kayıt var mı?
            $recentPlay = \DB::table('muzibu_song_plays')
                ->where('song_id', $songId)
                ->where('user_id', $userId)
                ->where('created_at', '>=', now()->subSeconds(30))
                ->first();

            // Eğer son 30 saniyede zaten kayıt varsa, duplicate kayıt ekleme
            if ($recentPlay) {
                return response()->json([
                    'success' => true,
                    'duplicate_prevented' => true
                ]);
            }

            // 30+ saniye dinlendi, kayıt ekle (Analytics için)
            \DB::table('muzibu_song_plays')->insert([
                'song_id' => $songId,
                'user_id' => $userId,
                'ip_address' => $request->ip(),
                'user_agent' => $request->userAgent(),
                'device_type' => $this->detectDevice($request),
                'created_at' => now(),
                'updated_at' => now()
            ]);
---
select * from `muzibu_song_plays` where `song_id` = 347 and `user_id` = 37 and `created_at` >= '2025-12-27 20:47:01' limit 1
insert into `muzibu_song_plays` (`song_id`, `user_id`, `ip_address`, `user_agent`, `device_type`, `created_at`, `updated_at`) values (347, 37, '88.230.89.180', 'Mozilla/5.0 (Linux; Android 6.0; Nexus 5 Build/MRA58N) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/109.0.0.0 Mobile Safari/537.36', 'mobile', '2025-12-27 20:47:31', '2025-12-27 20:47:31')

    protected function getSubscriptionData($user): array
    {
        if (!$user) {
            return [
                'is_premium' => false,
                'trial_ends_at' => null,
                'subscription_ends_at' => null,
            ];
        }

        // Aktif subscription var mı?
        $subscription = $user->subscriptions()
            ->whereIn('status', ['active', 'trial'])
            ->where(function($q) {
                $q->whereNull('current_period_end')
                  ->orWhere('current_period_end', '>', now());
            })
            ->first();
---
select * from `subscriptions` where `subscriptions`.`user_id` = 1 and `subscriptions`.`user_id` is not null and `status` in ('active', 'trial') and (`current_period_end` is null or `current_period_end` > '2025-12-28 00:53:08') and `subscriptions`.`deleted_at` is null limit 1