Modules/Muzibu/app/Http/Controllers/Api/SongController.php

    public function lastPlayed(): JsonResponse
    {
        try {
            $userId = auth()->id();

            // Get last played song from muzibu_song_plays table
            $lastPlay = \DB::table('muzibu_song_plays')
                ->where('user_id', $userId)
                ->orderBy('created_at', 'desc')
                ->first();
---
select * from `muzibu_song_plays` where `user_id` = 37 order by `created_at` desc limit 1