Modules/AI/app/Http/Controllers/Api/PublicAIController.php

select * from `ai_conversations` where (`session_id` = '5c9c1ac1274f05ae7a0ca827dc087b46' and `tenant_id` = 1001) limit 1
select * from `ai_messages` where `ai_messages`.`conversation_id` = 10794 and `ai_messages`.`conversation_id` is not null order by `created_at` desc limit 10
---

            // Find or create conversation
            // Note: user_id references tenant database users (no FK constraint since cross-database)
            $conversation = \Modules\AI\App\Models\AIConversation::firstOrCreate([
                'session_id' => $sessionId,
                'tenant_id' => $tenantId,
            ], [
                'user_id' => auth()->id(), // Tenant database user ID
                'feature_slug' => 'assistant',
                'status' => 'active',
                'ip_address' => $request->ip(),
                'user_agent' => $request->userAgent(),
            ]);

            // Get conversation history
            $conversationHistory = [];
            $messages = $conversation->messages()
                ->orderBy('created_at', 'desc')
                ->take(10)
                ->get()
                ->reverse()
                ->values();