Modules/Muzibu/app/Http/Controllers/Front/CorporateFrontController.php

select * from `muzibu_corporate_accounts` where `user_id` = 1 limit 1
---
    public function apiNextSpot(Request $request)
    {
        try {
            $user = auth()->user();

            if (!$user) {
                return response()->json([
                    'success' => false,
                    'error' => 'not_authenticated'
                ], 401);
            }

            $userCorporate = MuzibuCorporateAccount::where('user_id', $user->id)->first();

select * from `muzibu_corporate_accounts` where `user_id` = 1 limit 1
---
    public function apiSpotPlayStart(Request $request)
    {
        $request->validate([
            'spot_id' => 'required|integer|exists:muzibu_corporate_spots,id',
        ]);

        $user = auth()->user();
        $userCorporate = $user ? MuzibuCorporateAccount::where('user_id', $user->id)->first() : null;

select * from `muzibu_corporate_spot_plays` where `muzibu_corporate_spot_plays`.`id` = 417 limit 1
---
    public function apiSpotPlayEnd(Request $request)
    {
        $request->validate([
            'play_id' => 'required|integer|exists:muzibu_corporate_spot_plays,id',
            'listened_duration' => 'nullable|integer|min:0',
            'was_skipped' => 'nullable|boolean',
        ]);

        $play = \Modules\Muzibu\App\Models\CorporateSpotPlay::find($request->play_id);