Modules/Muzibu/app/Http/Controllers/Front/HomeController.php

    public function index(): View
    {
        try {
            //🔒 FIXED: Use Eloquent (tenant-aware) + Eager Loading
            // Only show playlists with at least 1 active song
            $featuredPlaylists = Playlist::where('is_active', 1)
                ->where('is_system', 1)
                ->whereHas('songs', function($q) {
                    $q->where('is_active', 1);
                })
                ->with(['songs' => function($q) {
                    $q->where('is_active', 1);
                }, 'coverMedia'])
                ->limit(10)
                ->get();

            // Only show albums with at least 1 active song
            $newReleases = Album::where('is_active', 1)
                ->whereHas('songs', function($q) {
                    $q->where('is_active', 1);
                })
                ->with(['artist', 'songs' => function($q) {
                    $q->where('is_active', 1);
                }, 'coverMedia'])
                ->orderBy('created_at', 'desc')
                ->limit(12)
                ->get();

            // Only show songs that have files uploaded
            $popularSongs = Song::where('is_active', 1)
                ->whereNotNull('file_path') // CRITICAL: Skip songs without files
                ->with(['album.artist', 'album.coverMedia', 'coverMedia']) // Load cover media for songs and albums
                ->orderBy('hls_converted', 'desc') // HLS songs first
                ->orderBy('play_count', 'desc')
                ->limit(20) // Limit to 20 popular songs
                ->get();

            // Only show genres with at least 1 active song
            $genres = Genre::where('is_active', 1)
                ->whereHas('songs', function($q) {
                    $q->where('is_active', 1);
                })
                ->with(['songs' => function($q) {
                    $q->where('is_active', 1);
                }, 'iconMedia'])
                ->get();

            // Get user's personal playlists (if logged in) - only with active songs
            $userPlaylists = auth()->check()
                ? Playlist::where('user_id', auth()->id())
                    ->where('is_active', 1)
                    ->whereHas('songs', function($q) {
                        $q->where('is_active', 1);
                    })
                    ->with(['songs' => function($q) {
                        $q->where('is_active', 1);
                    }, 'coverMedia'])
                    ->orderBy('created_at', 'desc')
                    ->get()
---
select * from `media` where `media`.`id` in (2038, 2040, 2041, 2042, 2043, 2044, 2045, 2046, 2047)
select * from `media` where `media`.`id` in (2031, 2032, 2033, 2034, 2035, 2036, 2037, 2054)
select * from `media` where `media`.`id` in (2050, 2051, 2052, 2072, 2073, 2075, 2076, 2077)
select * from `media` where `media`.`id` in (2082, 2083, 2084, 2085, 2086, 2087, 2088, 2089, 2090, 2091)
select * from `media` where `media`.`id` in (2048, 2049, 2050, 2051, 2052, 2053, 2054, 2055, 2056, 2057, 2058, 2059)