Modules/Muzibu/app/Http/Controllers/Front/MyPlaylistsController.php

    public function index()
    {
        if (!auth()->check()) {
            return redirect()->route('login');
        }

        $playlists = Playlist::where('user_id', auth()->id())
            ->where('is_system', false)
            ->with('coverMedia') // ✅ Eager load cover media
            ->withCount('songs')
            ->latest()
            ->paginate(40);
---
select * from `media` where `media`.`id` in (2133, 2134, 2163, 2165, 2166)