app/Http/Controllers/FaviconController.php

    private function getFaviconPath(): ?string
    {
        try {
            // Settings'den site_favicon key'ini çek
            $setting = Setting::where('key', 'site_favicon')
                ->where('is_active', true)
                ->first();
---
select * from `settings` where `key` = 'site_favicon' and `is_active` = 1 limit 1