app/Models/User.php

    public function isPremium(): bool
    {
        // Tenant yoksa false
        if (!$this->isMuzibuTenant()) {
            return false;
        }

        // 🚀 ULTRA FAST: Önce tenant users tablosundan kontrol
        // (Model zaten tenant context'inde yüklendiyse bu değer mevcut)
        if ($this->subscription_expires_at && $this->subscription_expires_at->isFuture()) {
            return true;
        }

        // Tenant DB'den fresh kontrol (model eski olabilir)
        $tenantExpiry = \DB::table('users')
            ->where('id', $this->id)
            ->value('subscription_expires_at');
---
select `subscription_expires_at` from `users` where `id` = 37 limit 1