app/Providers/TenancyServiceProvider.php

select * from `domains` where `tenant_id` = 1001 and `is_primary` = 1 limit 1
---

                    // 🍪 Cookie domain: Tenant-aware cookie domain
                    // Format: .domain.com (leading dot for subdomain support)
                    $primaryDomain = \App\Models\Domain::where('tenant_id', $tenantId)
                        ->where('is_primary', true)
                        ->first();