app/Repositories/ModuleRepository.php

    protected function fetchModulesForTenant(?string $tenantId): Collection
    {
        return TenantHelpers::central(function () use ($tenantId) {
            $query = Module::where('is_active', true);

            if ($tenantId) {
                // Tenant'a atanmış modülleri getir
                $query->join('module_tenants', 'modules.module_id', '=', 'module_tenants.module_id')
                      ->where('module_tenants.tenant_id', $tenantId)
                      ->where('module_tenants.is_active', true)
                      ->select([
                          'modules.*',
                          'module_tenants.assigned_at',
                          'module_tenants.is_active as tenant_active'
                      ]);
            }

            return $query->orderBy('display_name')->get();
---
select `modules`.*, `module_tenants`.`assigned_at`, `module_tenants`.`is_active` as `tenant_active` from `modules` inner join `module_tenants` on `modules`.`module_id` = `module_tenants`.`module_id` where `modules`.`is_active` = 1 and `module_tenants`.`tenant_id` = '1001' and `module_tenants`.`is_active` = 1 order by `modules`.`display_name` asc